Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: Because Git is designed to work with nearly any type of project, these tools are pretty generic, but they can often help you hunt for a bug or culprit when things go wrong.
cs: Protože je Git navržen tak, aby pracoval téměř s jakýmkoli typem projektu, jsou tyto nástroje velmi univerzální. Často vám mohou pomoci odhalit vzniklou chybu nebo problém.

source: Because Git is very flexible, people can and do work together in many ways, and it's problematic to describe how you should contribute – every project is a bit different.
cs: Git je velmi pružný, lidé mohou spolupracovat různými způsoby (a taky to tak dělají), takže není snadné popsat, jakým způsobem byste měli přispívat. Každý projekt je trochu jiný.

source: Because a branch in Git is in actuality a simple file that contains the 40 character SHA-1 checksum of the commit it points to, branches are cheap to create and destroy.
cs: A protože větev je v Gitu ve skutečnosti obyčejným souborem, který obsahuje 40 znaků kontrolního součtu SHA-1 revize, na kterou větev ukazuje, dají se větve snadno vytvářet i odstraňovat.

source: Because it contains work that isn't merged in yet, trying to delete it with `git branch -d` will fail:
cs: Jelikož obsahuje práci, která ještě nebyla začleněna, bude pokus o její smazání příkazem `git branch -d` neúspěšný:

source: Because that server has a subset of the data your `origin` server has right now, Git fetches no data but sets a remote-tracking branch called `teamone/master` to point to the commit that `teamone` has as its `master` branch.
cs: Protože je tento server podmnožinou dat, která jsou právě na serveru `origin`, Git nevyzvedne žádná data, ale nastaví vzdáleně sledovanou větev (remote-tracking branch) nazvanou `teamone/master` tak, aby ukazovala na stejný objekt revize, na který ukazuje větev `master` na serveru `teamone`.

source: Because the commit on the branch you're on isn't a direct ancestor of the branch you're merging in, Git has to do some work.
cs: Protože objekt revize, na kterém se ve větvi nacházíte, není přímým předkem větve, kterou připojujete, musí s tím Git něco udělat.

source: Because the commit pointed to by the branch you merged in was directly upstream of the commit you're on, Git simply moves the pointer forward.
cs: Protože byl objekt revize v začleňované větvi přímým následníkem objektu, na kterém jste, Git jednoduše přesune ukazatel vpřed.

source: Because the reflog data is kept in the `.git/logs/` directory, you effectively have no reflog.
cs: Protože se data pro reflog uchovávají v adresáři `.git/logs/`, nemáte evidentně žádný reflog.

source: Because the repository is only used as a collaboration point, there is no reason to have a snapshot checked out on disk; it's just the Git data.
cs: Protože se repozitář používá pouze jako místo pro spolupráci, není žádný důvod, aby byl na disku načten konkrétní snímek. Jsou zde uložena pouze data pro Git.

source: Because this is so common, you can replace this entire part with `-s`, which means standard layout and implies all those options.
cs: Protože se jedná o častou situaci, můžete celou tuto část nahradit parametrem `-s`, který označuje standardní layout a implikuje všechny uvedené parametry.

source: Because you already merged in `iss53` earlier, you see it in your list.
cs: Jelikož už jste větev `iss53` začlenili, zobrazila se v seznamu.

source: Because you don't have the permissions to directly update branches on the project, you have to get the work to the maintainers some other way.
cs: Protože nemáte oprávnění k tomu, abyste mohli aktualizovat větve projektu přímo, musíte svou práci správcům doručit nějakým jiným způsobem.

source: Because you have the entire history of the project right there on your local disk, most operations seem almost instantaneous.
cs: Protože máte celou historii projektu uloženou přímo na svém lokálním disku, probíhá většina operací takřka okamžitě.

source: Because you need to use the same format to specify the file contents later, you create a helper method, `export_data`:
cs: Protože budete stejný formát potřebovat i později, k určení obsahu souboru vytvoříte pomocnou metodu – `export_data`:

source: Because you only want the `old-file` and `new-file` arguments, you use the wrapper script to pass the ones you need.
cs: Protože chcete pouze parametry `old-file` a `new-file`, použijete wrapperový skript k zadání těch, které potřebujete.

source: Because you rebased the branch, you have to specify the `-f` to your push command in order to be able to replace the `featureA` branch on the server with a commit that isn't a descendant of it.
cs: Protože jste větev přeskládali, musíte u příkazu pro odesílání (push) přidat `-f`, abyste mohli serverové větvi `featureA` podsunout revizi, která není jejím potomkem.

source: Because you want all your branches and tags to go up, you can now run this:
cs: Protože do něj chcete odeslat všechny své větve a značky, můžete použít příkaz:

source: Because your starting point is the `ca82a6` commit object you saw in the `info/refs` file, you start by fetching that:
cs: Protože je vaším výchozím bodem objekt revize `ca82a6`, jak jste zjistili v souboru `info/refs`, začnete vyzvednutím tohoto objektu:

source: Before we can answer this, let's step back a bit and talk about what history means.
cs: Než na to budeme moci odpovědět, podívejme se na to s odstupem a proberme si, co rozumíme historií.

source: Before we start looking at the specific use cases, here's a quick note about commit messages.
cs: Než se podíváme na konkrétní případy, uveďme rychlou poznámku o zprávách k revizím.

source: Before you start using Git, you have to make it available on your computer.
cs: Než začnete Git používat, musíte jej na svém počítači zprovoznit.

source: Behind big corporate firewalls, this obscure port is commonly blocked.
cs: Velkými podnikovými firewally je tento málo rozšířený port většinou blokován.

source: Better get rid of it:
cs: Raději se ho zbavme:

source: Both files are staged and will go into your next commit.
cs: Oba soubory jsou nyní připraveny k zapsání a budou zahrnuty do příští revize.

source: Both of those changes are isolated in separate branches: you can switch back and forth between the branches and merge them together when you're ready.
cs: Oboje tyto změny jsou oddělené na samostatných větvích. Můžete mezi nimi přepínat tam a zpět, a až uznáte za vhodné, můžete je sloučit.

source: Branches on this list without the `*` in front of them are generally fine to delete with `git branch -d`; you've already incorporated their work into another branch, so you're not going to lose anything.
cs: Větve, před kterými v seznamu není `*`, můžeme většinou bez problémů smazat příkazem `git branch -d`. Práci v nich vytvořenou už jste zahrnuli do jiné větve, takže o nic nepřijdete.

source: Branching means you diverge from the main line of development and continue to do work without messing with that main line.
cs: Větvení znamená, že se můžete odloučit od hlavní linie vývoje a pokračovat v práci, aniž byste do hlavní linie zasahovali.

source: But because Git was initially a toolkit for a VCS rather than a full user-friendly VCS, it has a bunch of verbs that do low-level work and were designed to be chained together UNIX style or called from scripts.
cs: Protože však byl Git původně spíš soupravou nástrojů k verzování než plným, uživatelsky přívětivým systémem VCS, zná celou řadu příkazů pracujících na nižších úrovních, které byly původně spojovány ve stylu UNIXu nebo volány ze skriptů.

source: But in Git it's common to create, work on, merge, and delete branches several times a day.
cs: Ale v Gitu je běžné, že se větev vytvoří, pracuje se v ní, sloučí se a odstraní -- to vše i několikrát za den.

source: By default it will prompt you on the terminal for this information so the server can tell if you're allowed to push.
cs: Aby byl schopen zjistit, zda máte právo k odesílání (push), vypíše výzvu k zadání této informace na terminálu.

source: By default, Git passes the following arguments to the diff program:
cs: Standardně Git předává do nástoje diff tyto parametry:

source: By default, the `git push` command doesn't transfer tags to remote servers.(((git commands, push))) You will have to explicitly push tags to a shared server after you have created them.
cs: Příkaz `git push` nepřenáší značky na vzdálené servery automaticky.(((git příkazy, push))) Po vytvoření značky ji musíte na sdílený server poslat explicitně.

source: By default, with no arguments, `git log` lists the commits made in that repository in reverse chronological order – that is, the most recent commits show up first.
cs: Ve výchozím nastavení a bez dalších parametrů vypíše příkaz `git log` revize daného repozitáře v obráceném chronologickém pořadí -- poslední revize se zobrazí na začátku.

source: By now, you’ve learned most of the day-to-day commands and workflows that you need to manage or maintain a Git repository for your source code control.
cs: Do této chvíle jste stačili poznat většinu každodenních příkazů a pracovních postupů, které budete při práci se zdrojovým kódem potřebovat k ovládání a správě repozitáře Git.

source: By the end of the chapter, you should be able to configure and initialize a repository, begin and stop tracking files, and stage and commit changes.
cs: Po přečtení kapitoly byste měli být schopni nakonfigurovat a inicializovat repozitář, zahájit a ukončit sledování souborů, připravovat soubory k zápisu (stage) a zapisovat revize (commit).

source: Calling `git reset` without an option is not dangerous - it only touches your staging area.
cs: Volání `git reset` bez dalších parametrů není nebezpečné -- dotkne se jen oblasti připravených změn.

source: Change the commit message, and exit the editor.
cs: Změňte zprávu k revizi a zavřete textový editor.

source: Changes you submit may be rendered obsolete or severely broken by work that is merged in while you were working or while your changes were waiting to be approved or applied.
cs: Vámi odeslané změny se mohou ukázat jako zastaralé nebo vážně narušené pracemi, které byly do projektu začleněny během vaší práce, nebo v době, kdy vaše změny čekaly na schválení či aplikaci.

source: Changing your last commit is probably the most common rewriting of history that you’ll do.
cs: Změna poslední revize je pravděpodobně nejobvyklejším způsobem přepsání historie, který budete provádět.

source: Check the tree created by that commit, and you see something interesting:
cs: Prohlédněte si strom vytvořený touto revizí a uvidíte jednu zajímavou věc:

source: Collaborating with others involves managing these remote repositories and pushing and pulling data to and from them when you need to share work.
cs: Spolupráce s ostatními uživateli zahrnuje správu těchto vzdálených repozitářů a odesílání (push) a stahování dat (pull) v okamžicích kdy chcete práci sdílet.

source: Committed means that the data is safely stored in your local database.
cs: Zapsáno znamená, že jsou data bezpečně uložena ve vaší lokální databázi.

source: Conceptually, most other systems store information as a list of file-based changes.
cs: Většina ostatních systémů ukládá informace jako seznamy změn souborů.

source: Congratulations on being an effective Git developer!
cs: Gratulujeme, nyní je z vás efektivní gitový vývojář!

source: Consider an example of doing some work (on `master`), branching off for an issue (`iss91`), working on it for a bit, branching off the second branch to try another way of handling the same thing (`iss91v2`), going back to your `master` branch and working there for a while, and then branching off there to do some work that you're not sure is a good idea (`dumbidea` branch).
cs: Uvažujme příklad, kdy něco vytvoříte (v `master`), odvětvíte se kvůli řešení problému (`iss91`), chvíli na něm pracujete, vytvoříte druhou větev, abyste zkusili jiné řešení stejného problému (`iss91v2`). Vrátíte se zpět do větve `master`, kde chvíli pokračujete v práci a vytvoříte další větev, ve které chcete vyzkoušet něco, co by nemusel být dobrý nápad (větev `dumbidea`).

source: Contributors don't have to wait for the project to incorporate their changes – each party can work at their own pace.
cs: Přispěvatelé nemusí čekat, až budou jejich změny začleněny do projektu -- všichni zúčastnění mohou pracovat svým vlastním tempem.

source: Create a branch for a new story you're working on.
cs: Vytvoříte větev pro nový případ, na kterém pracujete.

source: Create a branch to add the hotfix.
cs: Vytvoříte větev pro přidání opravy.

source: Create a file called `users.txt` that has this mapping in a format like this:
cs: Vytvořte soubor `users.txt`, který bude toto mapování obsahovat v následující podobě:

source: Creating a new branch is as quick and simple as writing 41 bytes to a file (40 characters and a newline).
cs: Vytvořit novou větev je právě tak snadné a rychlé jako zapsat 41 bytů do souboru (40 znaků plus jeden pro nový řádek).

source: Do as we say, not as we do.
cs: Dělejte to, jak říkám, a ne jak to dělám.

source: Do some work in that branch.
cs: V této větvi něco uděláte.

source: Do work on a web site.
cs: Pracujete na webových stránkách.

source: Does it even have a policy?
cs: Je nějaká strategie vůbec určena?

source: Does the project have a maintainer or integration manager who checks all the patches?
cs: Má projekt svého správce nebo integračního manažera, který kontroluje všechny záplaty?

source: Doing so also puts the diff of your change in the editor so you can see exactly what changes you're committing.) When you exit the editor, Git creates your commit with that commit message (with the comments and diff stripped out).
cs: V editoru se pak zobrazí také výstup rozdílů (diff), takže uvidíte přesně, jaké změny budete zapisovat.) Jakmile editor zavřete, Git vytvoří objekt revize se zprávou, kterou jste napsali (s odstraněnými komentáři, které zobrazovaly rozdíly).

source: Doing so automatically runs `test-error.sh` on each checked-out commit until Git finds the first broken commit.
cs: Automaticky se spustí `test-error.sh` na všech načtených revizích, dokud Git nenajde první revizi s chybou.

source: Doing so launches your editor of choice.
cs: Po zadání příkazu se otevře vámi zvolený editor.

source: Doing so moves the `iss53` branch forward, because you have it checked out (that is, your `HEAD` is pointing to it):
cs: S každou novou revizí se větev `iss53` posune vpřed, protože jste na ni přepnutí (provedli jste `checkout` a `HEAD` na ni ukazuje):

source: Doing so offers a number of advantages: a hosting site is generally quick to set up and easy to start projects on, and no server maintenance or monitoring is involved.
cs: Toto řešení vám nabízí celou řadu výhod. Hostingové místo má většinou velmi rychlé nastavení, snadno se na něm zakládají projekty a nevyžaduje od vás správu ani monitoring serveru.

source: Don't ever use this command unless you absolutely know that you don't want the file.
cs: Nikdy tento příkaz nepoužívejte, pokud si nejste zcela jisti, že už daný soubor nebudete potřebovat.

source: Each developer has committed a few times and merged each other's work successfully.
cs: Každý z nich provedl několik zápisů (commit) a úspěšně začlenil (merge) práci toho druhého.

source: Each level overrides values in the previous level, so values in `.git/config` trump those in `/etc/gitconfig`.
cs: Každá úroveň je nadřazená hodnotám úrovně předchozí, takže hodnoty v `.git/config` převládnou nad hodnotami v `/etc/gitconfig`.

source: Each of the three commit objects points to one of the three snapshot trees you created.
cs: Všechny tři tyto objekty revizí ukazují na jeden ze tří stromů snímku, který jste vytvořili.

source: Each of these can be set to `true`, `false`, or `always`:
cs: Každý z příslušných parametrů může nabývat hodnoty na `true` (pravda), `false` (nepravda) nebo `always` (vždy):

source: Each time you commit or change branches, the reflog is updated.
cs: Vždy když zapíšete revizi nebo změníte větve, je reflog aktualizován.

source: Each time, Git will stop, let you amend the commit, and continue when you’re finished.
cs: Git pokaždé zastaví, nechá vás revizi upravit, a až budete hotovi, bude pokračovat.

source: Even commits that were on branches that were deleted or commits that were overwritten with an `--amend` commit can be recovered (see <<_data_recovery>> for data recovery).
cs: Obnovit lze dokonce i objekty revizí na odstraněných větvích nebo objekty revizí, které byly přepsány příkazem `commit --amend` (obnovování dat se věnuje kapitola <<_data_recovery>>).

source: Even if it's already installed, it's probably a good idea to update to the latest version.
cs: Dokonce i v případě, kdy už jej máte předinstalovaný, bude dobré, když provedete aktualizaci na poslední verzi.

source: Even if you don't commit during the weekend, use the staging area on Monday to split your work into at least one commit per issue, with a useful message per commit.
cs: Když už během víkendu nebudete zapisovat revize, využijte v pondělí oblasti připravených změn pro rozdělení práce alespoň do stejného počtu revizí, kolik je řešených problémů, a přidejte k nim vysvětlující zprávy.

source: Even the popular Mac OS X operating system includes the `rcs` command when you install the Developer Tools.
cs: Dokonce i populární operační systém Mac OS X obsahuje po nainstalování vývojářských nástrojů (Developer Tools) příkaz `rcs`.

source: Every clone is really a full backup of all the data.
cs: Každý klon je ve skutečnosti úplnou zálohou všech dat.

source: Every time you commit, it moves forward automatically.
cs: Pokaždé, když zapíšete novou revizi, větev se automaticky posune vpřed.

source: Every time you commit, or save the state of your project in Git, it basically takes a picture of what all your files look like at that moment and stores a reference to that snapshot.
cs: Pokaždé, když v systému Git zapíšete (commit{empty}footnote:[Pozn. překl.: Anglické slovo _commit_ má v informačních systémech specifický význam _zapsat_ nebo _potvrdit zápis_, jehož jemný odstín se bez kontextu špatně překládá. V této knize bude překládán jako _zápis_. Pokud by měl být zdůrazněn specifický výraz slova _commit_, bude anglický pojem uveden v závorce. Čeština je krásný jazyk, ale technické texty někdy vyžadují nebásnickou přesnost ;)]) stav projektu, v podstatě „vyfotí“, jak vypadají všechny vaše soubory v daném okamžiku, a uloží odkaz na tento snímek.

source: Every time you perform a commit, you're recording a snapshot of your project that you can revert to or compare to later.
cs: Pokaždé, když provedete příkaz `commit`, nahrajete snímek svého projektu, k němuž se můžete později vrátit nebo ho můžete použít k srovnání.

source: Every time your branch tip is updated for any reason, Git stores that information for you in this temporary history.
cs: Pokaždé, když je z nějakého důvodu aktualizován vrchol větve, Git tuto informaci uloží v dočasné historii reflog.

source: Every version of every file for the history of the project is pulled down by default when you run `git clone`.
cs: Po provedení příkazu `git clone` budou k historii projektu staženy všechny verze všech souborů.

source: Everything in Git is check-summed before it is stored and is then referred to by that checksum.
cs: Než se v Gitu cokoli uloží, nejdříve se z toho vypočítá kontrolní součet, který se pak používá k odkazu na uložená data.

source: Everything merges cleanly, and Jessica's history looks like this:
cs: Začlenění proběhne čistě a Jessičina historie bude vypadat následovně:

source: Exiting non-zero from this hook aborts the commit, although you can bypass it with `git commit --no-verify`.
cs: Je-li výstup tohoto zásuvného modulu nenulový, zapisování bude přerušeno. Ale můžete to obejít zadáním příkazu `git commit --no-verify`.

source: Finally we can see that our `testing` branch is not tracking any remote branch.
cs: A na konci vidíme, že naše větev `testing` nesleduje žádnou vzdálenou větev.

source: Finally, John's commit history looks like this:
cs: Johnova historie revizí nakonec vypadá takto:

source: Finally, she merges John's work into her own `featureA` branch:
cs: Nakonec začlení Johnovu práci do své vlastní větve `featureA`:

source: Finally, the command tells you which branch you're on and informs you that it has not diverged from the same branch on the server.
cs: Příkaz vám dále sděluje, na jaké větvi (branch) se nacházíte, a informuje vás, že se neodchýlila od stejné větve na serveru.

source: Finally, the server responds with a success (or failure) indication:
cs: Na závěr procesu server oznámí, zda se akce zdařila, nebo nezdařila:

source: Finally, you went back to your server branch and did a few more commits.
cs: Nakonec jste se vrátili na větev `server` a zapsali dalších pár objektů revize.

source: First you have to find it.
cs: Nejprve ho budete muset najít.

source: First you run `git bisect start` to get things going, and then you use `git bisect bad` to tell the system that the current commit you’re on is broken.
cs: Nejprve spustíte příkaz `git bisect start`, jímž celý proces zahájíte, a poté použijete příkaz `git bisect bad`, jímž systému oznámíte, že aktuální revize, na níž se právě nacházíte, obsahuje chybu.

source: First, add a large object to your history:
cs: Nejprve do historie přidejte velký objekt:

source: First, create a new file and save its contents in your database:
cs: Vytvořte nový soubor a uložte jeho obsah do své databáze:

source: First, it works offline, unlike the real `svn log` command, which asks the Subversion server for the data.
cs: Zaprvé to, že pracuje i off-line, na rozdíl od skutečného příkazu `svn log`, který si data vyžádá ze serveru Subversion.

source: First, she switches back to her master branch to integrate all this work:
cs: Nejdříve se přepne zpět na svou větev `master`, aby do ní mohla vše integrovat:

source: First, you again tell it the scope of the bisect by providing the known bad and good commits.
cs: Nejprve opět zadáte poslední známé revize s chybou a bez ní, jimiž vymezíte pracovní rozsah pro příkaz bisect.

source: First, you can inject the SHA-1 checksum of a blob into an `$Id$` field in the file automatically.
cs: První možností je automaticky vložit kontrolní součet SHA-1 blobu do pole `$Id$` v souboru.

source: First, you choose which protocols you want your server to communicate with.
cs: Nejprve určíte, jakými protokoly má váš server komunikovat.

source: First, you initialize a new Git repository and verify that there is nothing in the `objects` directory:
cs: Vytvořme nejprve nový repozitář Git. Můžeme se přesvědčit, že je adresář `objects` prázdný:

source: First, you need to get the Git source code, which GitWeb comes with, and generate the custom CGI script:
cs: Nejprve je třeba získat zdrojový kód systému Git, s nímž je GitWeb distribuován, a vygenerovat uživatelský CGI skript:

source: First, you need to require the library and then run `Zlib::Deflate.deflate()` on the content:
cs: Nejprve je třeba vyžádat si knihovnu a poté na obsah spustit příkaz `Zlib::Deflate.deflate()`:

source: First, you see this where the hook starts running.
cs: Zaprvé si všimněte místa, kde byl spuštěn zásuvný modul.

source: First, you'll probably want to clone the main repository, create a topic branch for the patch or patch series you're planning to contribute, and do your work there.
cs: Nejdříve pravděpodobně naklonujete hlavní repozitář, vytvoříte tématickou větev pro záplatu nebo pro posloupnost záplat, kterými chcete přispět, a zde vaši práci zrealizujete.
